Duet3D/Duet3Expansion/src/atmel/SAMC20_DFP/1.1.95/samc20/atdf/ATSAMC20J15A.atdf
        <register name="AHBMASK" offset="0x10" rw="RW" size="4" initval="0x00001CFF" caption="AHB Mask">
          <bitfield name="HPB0_" caption="HPB0 AHB Clock Mask" mask="0x1"/>
          <bitfield name="HPB1_" caption="HPB1 AHB Clock Mask" mask="0x2"/>
          <bitfield name="HPB2_" caption="HPB2 AHB Clock Mask" mask="0x4"/>
          <bitfield name="DSU_" caption="DSU AHB Clock Mask" mask="0x8"/>
          <bitfield name="HMATRIXHS_" caption="HMATRIXHS AHB Clock Mask" mask="0x10"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL AHB Clock Mask" mask="0x20"/>
          <bitfield name="HSRAM_" caption="HSRAM AHB Clock Mask" mask="0x40"/>
          <bitfield name="DMAC_" caption="DMAC AHB Clock Mask" mask="0x80"/>
          <bitfield name="PAC_" caption="PAC AHB Clock Mask" mask="0x400"/>
          <bitfield name="NVMCTRL_PICACHU_" caption="NVMCTRL_PICACHU AHB Clock Mask" mask="0x800"/>
          <bitfield name="DIVAS_" caption="DIVAS AHB Clock Mask" mask="0x1000"/>
        </register>
        <register name="APBAMASK" offset="0x14" rw="RW" size="4" initval="0x00000FFF" caption="APBA Mask">
          <bitfield name="PAC_" caption="PAC APB Clock Enable" mask="0x1"/>
          <bitfield name="PM_" caption="PM APB Clock Enable" mask="0x2"/>
          <bitfield name="MCLK_" caption="MCLK APB Clock Enable" mask="0x4"/>
          <bitfield name="RSTC_" caption="RSTC APB Clock Enable" mask="0x8"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL APB Clock Enable" mask="0x10"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL APB Clock Enable" mask="0x20"/>
          <bitfield name="SUPC_" caption="SUPC APB Clock Enable" mask="0x40"/>
          <bitfield name="GCLK_" caption="GCLK APB Clock Enable" mask="0x80"/>
          <bitfield name="WDT_" caption="WDT APB Clock Enable" mask="0x100"/>
          <bitfield name="RTC_" caption="RTC APB Clock Enable" mask="0x200"/>
          <bitfield name="EIC_" caption="EIC APB Clock Enable" mask="0x400"/>
          <bitfield name="FREQM_" caption="FREQM APB Clock Enable" mask="0x800"/>
        </register>
        <register name="APBBMASK" offset="0x18" rw="RW" size="4" initval="0x00000007" caption="APBB Mask">
          <bitfield name="PORT_" caption="PORT APB Clock Enable" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU APB Clock Enable" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL APB Clock Enable" mask="0x4"/>
          <bitfield name="HMATRIXHS_" caption="HMATRIXHS APB Clock Enable" mask="0x20"/>
        </register>
        <register name="APBCMASK" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="APBC Mask">
          <bitfield name="EVSYS_" caption="EVSYS APB Clock Enable" mask="0x1"/>
          <bitfield name="SERCOM0_" caption="SERCOM0 APB Clock Enable" mask="0x2"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 APB Clock Enable" mask="0x4"/>
          <bitfield name="SERCOM2_" caption="SERCOM2 APB Clock Enable" mask="0x8"/>
          <bitfield name="SERCOM3_" caption="SERCOM3 APB Clock Enable" mask="0x10"/>
          <bitfield name="TCC0_" caption="TCC0 APB Clock Enable" mask="0x200"/>
          <bitfield name="TCC1_" caption="TCC1 APB Clock Enable" mask="0x400"/>
          <bitfield name="TCC2_" caption="TCC2 APB Clock Enable" mask="0x800"/>
          <bitfield name="TC0_" caption="TC0 APB Clock Enable" mask="0x1000"/>
          <bitfield name="TC1_" caption="TC1 APB Clock Enable" mask="0x2000"/>
          <bitfield name="TC2_" caption="TC2 APB Clock Enable" mask="0x4000"/>
          <bitfield name="TC3_" caption="TC3 APB Clock Enable" mask="0x8000"/>
          <bitfield name="TC4_" caption="TC4 APB Clock Enable" mask="0x10000"/>
          <bitfield name="ADC0_" caption="ADC0 APB Clock Enable" mask="0x20000"/>
          <bitfield name="AC_" caption="AC APB Clock Enable" mask="0x100000"/>
          <bitfield name="PTC_" caption="PTC APB Clock Enable" mask="0x400000"/>
          <bitfield name="CCL_" caption="CCL APB Clock Enable" mask="0x800000"/>
          <bitfield name="TAL_" caption="TAL APB Clock Enable" mask="0x1000000"/>
        </register>
      </register-group>
      <value-group name="MCLK_CPUDIV__CPUDIV">
        <value name="DIV1" caption="Divide by 1" value="0x01"/>
        <value name="DIV2" caption="Divide by 2" value="0x02"/>
        <value name="DIV4" caption="Divide by 4" value="0x04"/>
        <value name="DIV8" caption="Divide by 8" value="0x08"/>
        <value name="DIV16" caption="Divide by 16" value="0x10"/>
        <value name="DIV32" caption="Divide by 32" value="0x20"/>
        <value name="DIV64" caption="Divide by 64" value="0x40"/>
        <value name="DIV128" caption="Divide by 128" value="0x80"/>
      </value-group>
    </module>
    <module name="MTB" id="U2002" version="1.0.0" caption="Cortex-M0+ Micro-Trace Buffer">
      <register-group name="MTB" caption="Cortex-M0+ Micro-Trace Buffer">
        <register name="POSITION" offset="0x0" rw="RW" size="4" access-size="4" caption="MTB Position">
          <bitfield name="WRAP" caption="Pointer Value Wraps" mask="0x4"/>
          <bitfield name="POINTER" caption="Trace Packet Location Pointer" mask="0xFFFFFFF8"/>
        </register>
        <register name="MASTER" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="MTB Master">
          <bitfield name="MASK" caption="Maximum Value of the Trace Buffer in SRAM" mask="0x1F"/>
          <bitfield name="TSTARTEN" caption="Trace Start Input Enable" mask="0x20"/>
          <bitfield name="TSTOPEN" caption="Trace Stop Input Enable" mask="0x40"/>
          <bitfield name="SFRWPRIV" caption="Special Function Register Write Privilege" mask="0x80"/>
          <bitfield name="RAMPRIV" caption="SRAM Privilege" mask="0x100"/>
          <bitfield name="HALTREQ" caption="Halt Request" mask="0x200"/>
          <bitfield name="EN" caption="Main Trace Enable" mask="0x80000000"/>
        </register>
        <register name="FLOW" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="MTB Flow">
          <bitfield name="AUTOSTOP" caption="Auto Stop Tracing" mask="0x1"/>
          <bitfield name="AUTOHALT" caption="Auto Halt Request" mask="0x2"/>
          <bitfield name="WATERMARK" caption="Watermark value" mask="0xFFFFFFF8"/>
        </register>
        <register name="BASE" offset="0xC" rw="R" size="4" access-size="4" caption="MTB Base">
        </register>
        <register name="ITCTRL" offset="0xF00" rw="RW" size="4" access-size="4" caption="MTB Integration Mode Control">
        </register>
        <register name="CLAIMSET" offset="0xFA0" rw="RW" size="4" access-size="4" atomic-op="set:CLAIMSET" caption="MTB Claim Set">
        </register>
        <register name="CLAIMCLR" offset="0xFA4" rw="RW" size="4" access-size="4" atomic-op="clear:CLAIMCLR" caption="MTB Claim Clear">
        </register>
        <register name="LOCKACCESS" offset="0xFB0" rw="RW" size="4" access-size="4" caption="MTB Lock Access">
        </register>
        <register name="LOCKSTATUS" offset="0xFB4" rw="R" size="4" access-size="4" caption="MTB Lock Status">
        </register>
        <register name="AUTHSTATUS" offset="0xFB8" rw="R" size="4" access-size="4" caption="MTB Authentication Status">
        </register>
        <register name="DEVARCH" offset="0xFBC" rw="R" size="4" access-size="4" caption="MTB Device Architecture">
        </register>
        <register name="DEVID" offset="0xFC8" rw="R" size="4" access-size="4" caption="MTB Device Configuration">
        </register>
        <register name="DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" caption="MTB Device Type">
        </register>
        <register name="PID4" offset="0xFD0" rw="R" size="4" access-size="4" caption="Peripheral Identification 4">
        </register>
        <register name="PID5" offset="0xFD4" rw="R" size="4" access-size="4" caption="Peripheral Identification 5">
        </register>
        <register name="PID6" offset="0xFD8" rw="R" size="4" access-size="4" caption="Peripheral Identification 6">
        </register>
