Duet3D/Duet3Expansion/src/atmel/SAMC20_DFP/1.1.95/samc20/atdf/ATSAMC20J15A.atdf
      <value-group name="NVMCTRL_CTRLB__RWS">
        <value name="SINGLE" caption="Single Auto Wait State" value="0"/>
        <value name="HALF" caption="Half Auto Wait State" value="1"/>
        <value name="DUAL" caption="Dual Auto Wait State" value="2"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLB__SLEEPPRM">
        <value name="WAKEONACCESS" caption="NVM block enters low-power mode when entering sleep.NVM block exits low-power mode upon first access." value="0"/>
        <value name="WAKEUPINSTANT" caption="NVM block enters low-power mode when entering sleep.NVM block exits low-power mode when exiting sleep." value="1"/>
        <value name="DISABLED" caption="Auto power reduction disabled." value="3"/>
      </value-group>
      <value-group name="NVMCTRL_PARAM__PSZ">
        <value name="8" caption="8 bytes" value="0x0"/>
        <value name="16" caption="16 bytes" value="0x1"/>
        <value name="32" caption="32 bytes" value="0x2"/>
        <value name="64" caption="64 bytes" value="0x3"/>
        <value name="128" caption="128 bytes" value="0x4"/>
        <value name="256" caption="256 bytes" value="0x5"/>
        <value name="512" caption="512 bytes" value="0x6"/>
        <value name="1024" caption="1024 bytes" value="0x7"/>
      </value-group>
    </module>
    <module name="FUSES" id="U2207" version="4.0.1" caption="Non-Volatile Fuses">
      <register-group name="OTP3_FUSES">
        <register name="OTP3_WORD_1" offset="0x4" size="4" rw="R" caption="OTP3 Page Word 1">
          <bitfield name="NVMCTRL_DUMMY2" caption="Dummy for OTP row." mask="0x80000000"/>
        </register>
      </register-group>
      <register-group name="OTP5_FUSES">
        <register name="OTP5_WORD_0" offset="0x0" size="4" rw="R" caption="OTP5 Page Word 0">
          <bitfield name="ADC0_BIASREFBUF" caption="ADC Bias Reference Buffer Scaling" mask="0x7"/>
          <bitfield name="ADC0_BIASCOMP" caption="ADC Comparator Scaling" mask="0x38"/>
        </register>
      </register-group>
      <register-group name="TEMP_LOG_FUSES">
        <register name="TEMP_LOG_WORD_0" offset="0x0" size="4" rw="R" caption="TEMP_LOG Page Word 0">
        </register>
      </register-group>
      <register-group name="USER_FUSES">
        <register name="USER_WORD_0" offset="0x0" size="4" rw="RW" caption="USER Page Word 0">
          <bitfield name="NVMCTRL_BOOTPROT" caption="Bootloader Size" mask="0x7"/>
          <bitfield name="NVMCTRL_EEPROM_SIZE" caption="EEPROM Size" mask="0x70"/>
          <bitfield name="BODVDDUSERLEVEL" caption="BODVDD User Level" mask="0x3F00"/>
          <bitfield name="BODVDD_DIS" caption="BODVDD Disable" mask="0x4000"/>
          <bitfield name="BODVDD_ACTION" caption="BODVDD Action" mask="0x18000"/>
          <bitfield name="BODCOREUSERLEVEL" caption="BODCORE User Level" mask="0x7E0000"/>
          <bitfield name="BODCORE_DIS" caption="BODCORE Disable" mask="0x800000"/>
          <bitfield name="BODCORE_ACTION" caption="BODCORE Action" mask="0x3000000"/>
          <bitfield name="WDT_ENABLE" caption="WDT Enable" mask="0x4000000"/>
          <bitfield name="WDT_ALWAYSON" caption="WDT Always On" mask="0x8000000"/>
          <bitfield name="WDT_PER" caption="WDT Period" mask="0xF0000000"/>
        </register>
        <register name="USER_WORD_1" offset="0x4" size="4" rw="RW" caption="USER Page Word 1">
          <bitfield name="WDT_WINDOW" caption="WDT Window" mask="0xF"/>
          <bitfield name="WDT_EWOFFSET" caption="WDT Early Warning Offset" mask="0xF0"/>
          <bitfield name="WDT_WEN" caption="WDT Window Mode Enable" mask="0x100"/>
          <bitfield name="BODVDD_HYST" caption="BODVDD Hysterisis" mask="0x200"/>
          <bitfield name="BODCORE_HYST" caption="BODCORE Hysterisis" mask="0x400"/>
          <bitfield name="NVMCTRL_REGION_LOCKS" caption="NVM Region Locks" mask="0xFFFF0000"/>
        </register>
      </register-group>
    </module>
    <module name="OSCCTRL" id="U2119" version="2.1.0" caption="Oscillators Control">
      <register-group name="OSCCTRL" caption="Oscillators Control">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSCRDY" caption="XOSC Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="XOSCFAIL" caption="XOSC Clock Failure Detector Interrupt Enable" mask="0x2"/>
          <bitfield name="OSC48MRDY" caption="OSC48M Ready Interrupt Enable" mask="0x10"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise Interrupt Enable" mask="0x100"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall Interrupt Enable" mask="0x200"/>
          <bitfield name="DPLLLTO" caption="DPLL Time Out Interrupt Enable" mask="0x400"/>
          <bitfield name="DPLLLDRTO" caption="DPLL Ratio Ready Interrupt Enable" mask="0x800"/>
        </register>
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="XOSCRDY" caption="XOSC Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="XOSCFAIL" caption="XOSC Clock Failure Detector Interrupt Enable" mask="0x2"/>
          <bitfield name="OSC48MRDY" caption="OSC48M Ready Interrupt Enable" mask="0x10"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise Interrupt Enable" mask="0x100"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall Interrupt Enable" mask="0x200"/>
          <bitfield name="DPLLLTO" caption="DPLL Time Out Interrupt Enable" mask="0x400"/>
          <bitfield name="DPLLLDRTO" caption="DPLL Ratio Ready Interrupt Enable" mask="0x800"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
          <bitfield name="XOSCFAIL" caption="XOSC Clock Failure Detector" mask="0x2"/>
          <bitfield name="OSC48MRDY" caption="OSC48M Ready" mask="0x10"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise" mask="0x100"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall" mask="0x200"/>
          <bitfield name="DPLLLTO" caption="DPLL Timeout" mask="0x400"/>
          <bitfield name="DPLLLDRTO" caption="DPLL Ratio Ready" mask="0x800"/>
        </register>
